lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
#include "HardwareSerial.h"

#include "Arduino.h"

#include <string.h>

namespace {

static constexpr uint32_t kPselDisconnected = 0xFFFFFFFFUL;
static constexpr uint32_t kRxFrameTimeoutBits = 32UL;
static constexpr uint32_t kBridgeCoalesceUs = 1500UL;

// UARTE register offsets.
static constexpr uint32_t U_TASKS_FLUSHRX      = 0x01CUL;
static constexpr uint32_t U_TASKS_DMA_RX_START = 0x028UL;
static constexpr uint32_t U_TASKS_DMA_RX_STOP  = 0x02CUL;
static constexpr uint32_t U_TASKS_DMA_TX_START = 0x050UL;
static constexpr uint32_t U_TASKS_DMA_TX_STOP  = 0x054UL;

static constexpr uint32_t U_EVENTS_ERROR       = 0x114UL;
static constexpr uint32_t U_EVENTS_RXTO        = 0x124UL;
static constexpr uint32_t U_EVENTS_TXSTOPPED   = 0x130UL;
static constexpr uint32_t U_EVENTS_DMA_RX_END  = 0x14CUL;
static constexpr uint32_t U_EVENTS_DMA_RX_READY = 0x150UL;
static constexpr uint32_t U_EVENTS_DMA_TX_END  = 0x168UL;
static constexpr uint32_t U_EVENTS_DMA_TX_BUSERROR = 0x170UL;
static constexpr uint32_t U_EVENTS_FRAMETIMEOUT = 0x174UL;

static constexpr uint32_t U_SHORTS             = 0x200UL;
static constexpr uint32_t U_INTENSET           = 0x304UL;
static constexpr uint32_t U_INTENCLR           = 0x308UL;

static constexpr uint32_t U_ERRORSRC           = 0x480UL;
static constexpr uint32_t U_ENABLE             = 0x500UL;
static constexpr uint32_t U_BAUDRATE           = 0x524UL;
static constexpr uint32_t U_CONFIG             = 0x56CUL;
static constexpr uint32_t U_ADDRESS            = 0x574UL;
static constexpr uint32_t U_FRAMETIMEOUT       = 0x578UL;

static constexpr uint32_t U_PSEL_TXD           = 0x604UL;
static constexpr uint32_t U_PSEL_CTS           = 0x608UL;
static constexpr uint32_t U_PSEL_RXD           = 0x60CUL;
static constexpr uint32_t U_PSEL_RTS           = 0x610UL;

static constexpr uint32_t U_DMA_RX_PTR         = 0x704UL;
static constexpr uint32_t U_DMA_RX_MAXCNT      = 0x708UL;
static constexpr uint32_t U_DMA_RX_AMOUNT      = 0x70CUL;
static constexpr uint32_t U_DMA_TX_PTR         = 0x73CUL;
static constexpr uint32_t U_DMA_TX_MAXCNT      = 0x740UL;

static inline volatile uint32_t& reg32(uintptr_t addr) {
    return *reinterpret_cast<volatile uint32_t*>(addr);
}

static inline uint32_t make_psel(uint8_t port, uint8_t pin) {
    return (static_cast<uint32_t>(pin) & 0x1FU) |
           ((static_cast<uint32_t>(port) & 0x7UL) << 5U);
}

static bool decode_pin(uint8_t pin, uint8_t* port, uint8_t* p) {
    return pinToPortPin(pin, port, p);
}

static NRF_GPIO_Type* gpio_for_port(uint8_t port) {
    switch (port) {
        case 0: return NRF_P0;
        case 1: return NRF_P1;
        case 2: return NRF_P2;
        default: return nullptr;
    }
}

static void configure_pin_output(uint8_t port, uint8_t pin, bool high) {
    NRF_GPIO_Type* gpio = gpio_for_port(port);
    if (gpio == nullptr) {
        return;
    }
    const uint32_t bit = (1UL << pin);
    gpio->DIRSET = bit;
    if (high) {
        gpio->OUTSET = bit;
    } else {
        gpio->OUTCLR = bit;
    }
}

static void configure_pin_input(uint8_t port, uint8_t pin, bool pullup) {
    NRF_GPIO_Type* gpio = gpio_for_port(port);
    if (gpio == nullptr) {
        return;
    }
    const uint32_t bit = (1UL << pin);
    gpio->DIRCLR = bit;

    uint32_t cnf = gpio->PIN_CNF[pin];
    cnf &= ~(GPIO_PIN_CNF_DIR_Msk | GPIO_PIN_CNF_INPUT_Msk | GPIO_PIN_CNF_PULL_Msk);
    cnf |= (GPIO_PIN_CNF_DIR_Input << GPIO_PIN_CNF_DIR_Pos);
    cnf |= GPIO_PIN_CNF_INPUT_Connect;
    cnf |= (pullup ? GPIO_PIN_CNF_PULL_Pullup : GPIO_PIN_CNF_PULL_Disabled);
    gpio->PIN_CNF[pin] = cnf;
}

static uint32_t baud_to_reg(unsigned long baud) {
    if (baud >= 1000000UL) {
        return UARTE_BAUDRATE_BAUDRATE_Baud1M;
    }
    if (baud >= 115200UL) {
        return UARTE_BAUDRATE_BAUDRATE_Baud115200;
    }
    if (baud >= 57600UL) {
        return UARTE_BAUDRATE_BAUDRATE_Baud57600;
    }
    if (baud >= 38400UL) {
        return UARTE_BAUDRATE_BAUDRATE_Baud38400;
    }
    if (baud >= 19200UL) {
        return UARTE_BAUDRATE_BAUDRATE_Baud19200;
    }
    return UARTE_BAUDRATE_BAUDRATE_Baud9600;
}

struct UarteFormat {
    uint32_t configReg;
    uint8_t dataMask;
};

static UarteFormat decode_serial_format(uint16_t config) {
    UarteFormat fmt{};
    // Preserve a valid baseline. On nRF54, CONFIG also contains FRAMESIZE and
    // other fields; leaving FRAMESIZE at 0 produces undefined behavior.
    fmt.configReg = (UARTE_CONFIG_HWFC_Disabled << UARTE_CONFIG_HWFC_Pos) |
                    (UARTE_CONFIG_FRAMESIZE_8bit << UARTE_CONFIG_FRAMESIZE_Pos);
    fmt.dataMask = 0xFFU;

    const uint8_t dataBits = static_cast<uint8_t>(5U + ((config >> 1U) & 0x3U));
    if (dataBits < 8U) {
        fmt.dataMask = static_cast<uint8_t>((1U << dataBits) - 1U);
    }

    const uint8_t paritySel = static_cast<uint8_t>(config & 0x30U);
    if (paritySel == 0x20U || paritySel == 0x30U) {
        fmt.configReg |= (UARTE_CONFIG_PARITY_Included << UARTE_CONFIG_PARITY_Pos);
        fmt.configReg |= ((paritySel == 0x30U ? UARTE_CONFIG_PARITYTYPE_Odd
                                              : UARTE_CONFIG_PARITYTYPE_Even)
                          << UARTE_CONFIG_PARITYTYPE_Pos);
    } else {
        fmt.configReg |= (UARTE_CONFIG_PARITY_Excluded << UARTE_CONFIG_PARITY_Pos);
    }

    fmt.configReg |= (((config & 0x08U) != 0U ? UARTE_CONFIG_STOP_Two
                                               : UARTE_CONFIG_STOP_One)
                      << UARTE_CONFIG_STOP_Pos);

    return fmt;
}

static bool wait_event_timeout_us(uintptr_t base, uint32_t event_off, uint32_t timeout_us) {
    const unsigned long start = micros();
    while ((unsigned long)(micros() - start) < timeout_us) {
        if (reg32(base + event_off) != 0U) {
            return true;
        }
    }
    return reg32(base + event_off) != 0U;
}

static uint32_t serial_byte_timeout_us(unsigned long baud, uint32_t bytes) {
    if (baud == 0UL) {
        baud = 9600UL;
    }
    if (bytes == 0U) {
        bytes = 1U;
    }
    // 12 bits/byte includes start/data/parity/stop margin.
    const uint32_t per_byte = static_cast<uint32_t>((12000000ULL + baud - 1ULL) / baud);
    // Keep this small: Serial.available()/read() should not block for milliseconds.
    // Long blocking delays will starve the cooperative BLE stack and cause 0x08
    // supervision timeouts under load.
    // Tuned compromise: keep polling responsive while giving RX enough dwell time
    // to catch the first byte of a burst when called periodically.
    const uint32_t margin = 500UL;
    return (per_byte * bytes) + margin;
}

static uint32_t bridge_settle_delay_us(unsigned long baud) {
    return serial_byte_timeout_us(baud, 3U);
}

static constexpr uint32_t kUarteRxInterruptMask =
    UARTE_INTENCLR_ERROR_Msk |
    UARTE_INTENCLR_RXTO_Msk |
    UARTE_INTENCLR_FRAMETIMEOUT_Msk |
    UARTE_INTENCLR_DMARXEND_Msk |
    UARTE_INTENCLR_DMARXREADY_Msk;
static constexpr uint32_t kUarteTxInterruptMask =
    UARTE_INTENCLR_TXSTOPPED_Msk |
    UARTE_INTENCLR_DMATXBUSERROR_Msk;
static uint8_t g_ownedConstlatUsers = 0U;

static bool buffer_has_line_boundary(const uint8_t* buffer, size_t size) {
    if (buffer == nullptr) {
        return false;
    }

    for (size_t i = 0U; i < size; ++i) {
        if (buffer[i] == static_cast<uint8_t>('\n') ||
            buffer[i] == static_cast<uint8_t>('\r')) {
            return true;
        }
    }

