lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
    return false;
}

extern "C" void nrf54l15_wire_handle_shared_irq(const NRF_TWIM_Type* twim);

static bool uart_try_irqn_for_instance(const NRF_UARTE_Type* uart, IRQn_Type* irqn) {
    if (irqn == nullptr || uart == nullptr) {
        return false;
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(uart);
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE00)) {
        *irqn = SPIM00_IRQn;
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE20)) {
        *irqn = SPIM20_IRQn;
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE21)) {
        *irqn = SPIM21_IRQn;
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE22)) {
        *irqn = SPIM22_IRQn;
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE30)) {
        *irqn = SPIM30_IRQn;
        return true;
    }
    return false;
}

static HardwareSerial* g_uarte00Owner = nullptr;
static HardwareSerial* g_uarte20Owner = nullptr;
static HardwareSerial* g_uarte21Owner = nullptr;
static HardwareSerial* g_uarte22Owner = nullptr;
static HardwareSerial* g_uarte30Owner = nullptr;
static HardwareSerial* g_unknownOwner = nullptr;

static HardwareSerial*& uart_owner_slot(const NRF_UARTE_Type* uart) {
    const uintptr_t base = reinterpret_cast<uintptr_t>(uart);
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE00)) {
        return g_uarte00Owner;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE20)) {
        return g_uarte20Owner;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE21)) {
        return g_uarte21Owner;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE22)) {
        return g_uarte22Owner;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE30)) {
        return g_uarte30Owner;
    }
    return g_unknownOwner;
}

}  // namespace

extern "C" void SPIM00_IRQHandler(void) {
    if (g_uarte00Owner != nullptr) {
        g_uarte00Owner->handleIrq();
    }
}

extern "C" void SPIM20_IRQHandler(void) {
    if (g_uarte20Owner != nullptr) {
        g_uarte20Owner->handleIrq();
    }
}

extern "C" void SPIM21_IRQHandler(void) {
    if (g_uarte21Owner != nullptr) {
        g_uarte21Owner->handleIrq();
    }
}

extern "C" void SPIM22_IRQHandler(void) {
    if (g_uarte22Owner != nullptr) {
        g_uarte22Owner->handleIrq();
    }
    nrf54l15_wire_handle_shared_irq(NRF_TWIM22);
}

extern "C" void SPIM30_IRQHandler(void) {
    if (g_uarte30Owner != nullptr) {
        g_uarte30Owner->handleIrq();
    }
    nrf54l15_wire_handle_shared_irq(NRF_TWIM30);
}

HardwareSerial::HardwareSerial(NRF_UARTE_Type* uart, uint8_t txPin, uint8_t rxPin)
    : _uart(uart),
      _txPin(txPin),
      _rxPin(rxPin),
      _configured(false),
      _constlatOwned(false),
      _baud(9600UL),
      _config(0U),
      _rxHead(0U),
      _rxTail(0U),
      _rxCount(0U),
      _rxDropped(0U),
      _rxDmaBuffer{{0U}, {0U}},
      _rxDmaActive(0U),
      _rxDmaPrepared(1U),
      _rxDmaRunning(false),
      _rxDmaObservedAmount(0U),
      _rxDmaLastActivityUs(0U),
      _txHead(0U),
      _txTail(0U),
      _txCount(0U),
      _txDmaCount(0U),
      _txDmaRunning(false),
      _txBuffer{0},
      _bridgePending{0},
      _bridgePendingCount(0U),
      _bridgePendingLastWriteUs(0U),
      _dataMask(0xFFU),
      _txRing{0},
      _rxRing{0} {}

void HardwareSerial::commitRxBytes(const uint8_t* data, uint32_t amount) {
    if (data == nullptr || amount == 0U) {
        return;
    }
    if (amount > kRxDmaChunkSize) {
        amount = kRxDmaChunkSize;
    }

    for (uint32_t i = 0; i < amount; ++i) {
        const uint8_t value = data[i];
        if (_rxCount >= kRxRingSize) {
            ++_rxDropped;
        } else {
            _rxRing[_rxHead] = value;
            _rxHead = static_cast<uint16_t>(
                (_rxHead + 1U) & static_cast<uint16_t>(kRxRingSize - 1U));
            ++_rxCount;
        }
    }
}

void HardwareSerial::begin(unsigned long baud) {
    begin(baud, SERIAL_8N1);
}

void HardwareSerial::begin(unsigned long baud, uint16_t config) {
    if (_uart == nullptr) {
        return;
    }
    if (_configured) {
        end();
    }

    uint8_t txPort = 0, tx = 0, rxPort = 0, rx = 0;
    if (!decode_pin(_txPin, &txPort, &tx) || !decode_pin(_rxPin, &rxPort, &rx)) {
        return;
    }

    configure_pin_output(txPort, tx, true);
    configure_pin_input(rxPort, rx, true);
    requestConstlatIfNeeded();

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);

    reg32(base + U_ENABLE) = UARTE_ENABLE_ENABLE_Disabled;
    reg32(base + U_PSEL_TXD) = make_psel(txPort, tx);
    reg32(base + U_PSEL_RXD) = make_psel(rxPort, rx);
    reg32(base + U_PSEL_CTS) = kPselDisconnected;
    reg32(base + U_PSEL_RTS) = kPselDisconnected;
    const UarteFormat fmt = decode_serial_format(config);
    _dataMask = fmt.dataMask;
    reg32(base + U_CONFIG) = fmt.configReg |
                             (UARTE_CONFIG_FRAMETIMEOUT_Enabled << UARTE_CONFIG_FRAMETIMEOUT_Pos);
    reg32(base + U_BAUDRATE) = baud_to_reg(baud);
    reg32(base + U_ADDRESS) = 0U;
    reg32(base + U_FRAMETIMEOUT) = kRxFrameTimeoutBits;
    reg32(base + U_SHORTS) |= UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Msk;
    reg32(base + U_ENABLE) = UARTE_ENABLE_ENABLE_Enabled;

    _baud = baud;
    _config = config;
    _rxHead = 0U;
    _rxTail = 0U;
    _rxCount = 0U;
    _rxDropped = 0U;
    _rxDmaActive = 0U;
    _rxDmaPrepared = 1U;
    _rxDmaRunning = false;
    _rxDmaObservedAmount = 0U;
    _rxDmaLastActivityUs = 0U;
    _txHead = 0U;
    _txTail = 0U;
    _txCount = 0U;
    _txDmaCount = 0U;
    _txDmaRunning = false;
    _bridgePendingCount = 0U;
    _bridgePendingLastWriteUs = 0U;
    _configured = true;

    IRQn_Type irqn = Reset_IRQn;
    if (uart_try_irqn_for_instance(_uart, &irqn)) {
        HardwareSerial*& owner = uart_owner_slot(_uart);
        owner = this;
        NVIC_DisableIRQ(irqn);
        NVIC_ClearPendingIRQ(irqn);
        NVIC_SetPriority(irqn, 2U);
        NVIC_EnableIRQ(irqn);
    }
    reg32(base + U_EVENTS_DMA_TX_END) = 0U;
    reg32(base + U_EVENTS_DMA_TX_BUSERROR) = 0U;
    reg32(base + U_EVENTS_TXSTOPPED) = 0U;
    reg32(base + U_INTENCLR) = kUarteTxInterruptMask;
    if (!usesBridgePins()) {
        reg32(base + U_INTENSET) = kUarteTxInterruptMask;
    }
    startRxDma();
}

void HardwareSerial::end() {
    if (_uart == nullptr) {
        return;
    }

    flushBridgePending(true);
    stopRxDma();

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);
    reg32(base + U_INTENCLR) = kUarteRxInterruptMask | kUarteTxInterruptMask;
    reg32(base + U_SHORTS) &= ~UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Msk;
    reg32(base + U_TASKS_DMA_TX_STOP) = UARTE_TASKS_DMA_TX_STOP_STOP_Trigger;
    reg32(base + U_ENABLE) = UARTE_ENABLE_ENABLE_Disabled;

    reg32(base + U_PSEL_TXD) = kPselDisconnected;
    reg32(base + U_PSEL_RXD) = kPselDisconnected;
    reg32(base + U_PSEL_CTS) = kPselDisconnected;
    reg32(base + U_PSEL_RTS) = kPselDisconnected;

    IRQn_Type irqn = Reset_IRQn;
    if (uart_try_irqn_for_instance(_uart, &irqn)) {
        HardwareSerial*& owner = uart_owner_slot(_uart);
        if (owner == this) {
            NVIC_DisableIRQ(irqn);
            NVIC_ClearPendingIRQ(irqn);
            owner = nullptr;
        }
    }

    _configured = false;
    _rxHead = 0U;
    _rxTail = 0U;
    _rxCount = 0U;
    _txHead = 0U;
    _txTail = 0U;
    _txCount = 0U;
    _txDmaCount = 0U;
    _txDmaRunning = false;
    _bridgePendingCount = 0U;
    _bridgePendingLastWriteUs = 0U;
    releaseConstlatIfNeeded();
}

bool HardwareSerial::setPins(int8_t rxPin, int8_t txPin) {
    if (_uart == nullptr) {
        return false;
    }

