lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
    const uint8_t nextRxPin = (rxPin >= 0) ? static_cast<uint8_t>(rxPin) : _rxPin;
    const uint8_t nextTxPin = (txPin >= 0) ? static_cast<uint8_t>(txPin) : _txPin;

    uint8_t txPort = 0;
    uint8_t tx = 0;
    uint8_t rxPort = 0;
    uint8_t rx = 0;
    if (!decode_pin(nextTxPin, &txPort, &tx) || !decode_pin(nextRxPin, &rxPort, &rx)) {
        return false;
    }

    const bool wasConfigured = _configured;
    const unsigned long baud = _baud;
    const uint16_t config = _config;

    if (wasConfigured) {
        end();
    }

    _txPin = nextTxPin;
    _rxPin = nextRxPin;

    if (!wasConfigured) {
        return true;
    }

    begin(baud, config);
    return _configured;
}

void HardwareSerial::startRxDma() {
    if (!_configured || _uart == nullptr) {
        return;
    }
    if (_constlatOwned) {
        NRF_POWER->TASKS_CONSTLAT = POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger;
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);

    reg32(base + U_INTENCLR) = kUarteRxInterruptMask;
    reg32(base + U_EVENTS_DMA_RX_END) = 0U;
    reg32(base + U_EVENTS_DMA_RX_READY) = 0U;
    reg32(base + U_EVENTS_ERROR) = 0U;
    reg32(base + U_EVENTS_RXTO) = 0U;
    reg32(base + U_EVENTS_FRAMETIMEOUT) = 0U;
    reg32(base + U_ERRORSRC) = 0xFFFFFFFFUL;

    // Enable FRAMETIMEOUT→DMA_RX_STOP shortcut so the idle-line timeout causes a
    // proper DMA stop that fires DMA_RX_END with the correct byte count.
    // DMA_RX_AMOUNT is only valid after a DMA completion event; without this
    // shortcut, flushPartialRxDma would read a stale count from the previous
    // transfer and corrupt the ring buffer.
    reg32(base + U_SHORTS) |= UARTE_SHORTS_FRAMETIMEOUT_DMA_RX_STOP_Msk;

    memset(_rxDmaBuffer[_rxDmaActive], 0, HardwareSerial::kRxDmaChunkSize);
    reg32(base + U_DMA_RX_PTR) =
        static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&_rxDmaBuffer[_rxDmaActive][0]));
    reg32(base + U_DMA_RX_MAXCNT) = HardwareSerial::kRxDmaChunkSize;
    reg32(base + U_TASKS_DMA_RX_START) = UARTE_TASKS_DMA_RX_START_START_Trigger;
    _rxDmaRunning = true;
    _rxDmaObservedAmount = 0U;
    _rxDmaLastActivityUs = micros();
    reg32(base + U_INTENSET) = kUarteRxInterruptMask;
}

void HardwareSerial::stopRxDma() {
    if (_uart == nullptr) {
        return;
    }
    if (!_rxDmaRunning) {
        return;
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);
    reg32(base + U_INTENCLR) = kUarteRxInterruptMask;
    reg32(base + U_SHORTS) &= ~(UARTE_SHORTS_DMA_RX_END_DMA_RX_START_Msk |
                                UARTE_SHORTS_FRAMETIMEOUT_DMA_RX_STOP_Msk);
    reg32(base + U_EVENTS_RXTO) = 0U;
    reg32(base + U_EVENTS_FRAMETIMEOUT) = 0U;
    reg32(base + U_TASKS_DMA_RX_STOP) = UARTE_TASKS_DMA_RX_STOP_STOP_Trigger;
    wait_event_timeout_us(base, U_EVENTS_RXTO, serial_byte_timeout_us(_baud, 2U));
    reg32(base + U_ERRORSRC) = 0xFFFFFFFFUL;
    _rxDmaRunning = false;
}

void HardwareSerial::flushPartialRxDma(uintptr_t base) {
    if (!_rxDmaRunning) {
        return;
    }

    uint32_t amount = reg32(base + U_DMA_RX_AMOUNT);
    if (amount > kRxDmaChunkSize) {
        amount = kRxDmaChunkSize;
    }
    if (amount <= _rxDmaObservedAmount) {
        return;
    }

    const uint32_t delta = amount - _rxDmaObservedAmount;
    commitRxBytes(&_rxDmaBuffer[_rxDmaActive][_rxDmaObservedAmount], delta);
    _rxDmaObservedAmount = static_cast<uint8_t>(amount);
    _rxDmaLastActivityUs = micros();
}

void HardwareSerial::processRxDmaEvents() {
    if (!_configured || _uart == nullptr) {
        return;
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);
    if ((reg32(base + U_EVENTS_ERROR) != 0U) || (reg32(base + U_ERRORSRC) != 0U)) {
        reg32(base + U_EVENTS_ERROR) = 0U;
        reg32(base + U_ERRORSRC) = 0xFFFFFFFFUL;
        // Per nRF54L15 PS §8.25.7, OVERRUN does not stop the UART receiver —
        // clearing the error flags is sufficient recovery.  Do NOT call
        // stopRxDma() here: its 708 µs blocking wait for RXTO lets the FIFO
        // overflow again immediately under a continuous data burst (large paste),
        // producing another OVERRUN on every restart and permanently breaking RX
        // until reboot.  Fall through: if MAXCNT was also reached simultaneously,
        // DMA_RX_END is set below and will flush the valid bytes and restart DMA.
        // If DMA is still running (< MAXCNT), it continues normally.
    }

    if (reg32(base + U_EVENTS_DMA_RX_READY) != 0U) {
        reg32(base + U_EVENTS_DMA_RX_READY) = 0U;
        // DMA_RX_AMOUNT is stale until DMA_RX_END fires; skip flush here.
    }

    if (reg32(base + U_EVENTS_FRAMETIMEOUT) != 0U) {
        reg32(base + U_EVENTS_FRAMETIMEOUT) = 0U;
        // The FRAMETIMEOUT→DMA_RX_STOP shortcut has already triggered the stop
        // task.  DMA_RX_END will fire with the correct byte count once the DMA
        // has stopped; commit bytes there, not here, to avoid reading a stale
        // DMA_RX_AMOUNT from the previous transfer.
    }

    if (reg32(base + U_EVENTS_RXTO) != 0U) {
        reg32(base + U_EVENTS_RXTO) = 0U;
        // Receiver stopped (follows DMA_RX_STOP).  DMA_RX_END carries the
        // valid count; do not flush with a potentially stale AMOUNT here.
    }

    if (reg32(base + U_EVENTS_DMA_RX_END) == 0U) {
        return;
    }

    reg32(base + U_EVENTS_DMA_RX_END) = 0U;
    flushPartialRxDma(base);
    memset(_rxDmaBuffer[_rxDmaActive], 0, kRxDmaChunkSize);
    _rxDmaRunning = false;
    _rxDmaObservedAmount = 0U;
    _rxDmaLastActivityUs = micros();
    startRxDma();
}

void HardwareSerial::serviceRxDma() {
    if (!_configured || _uart == nullptr) {
        return;
    }

    const uint32_t primask = __get_PRIMASK();
    __disable_irq();
    if (!_rxDmaRunning) {
        startRxDma();
        __set_PRIMASK(primask);
        return;
    }
    processRxDmaEvents();
    // Do NOT call flushPartialRxDma unconditionally here.  On nRF54L15,
    // DMA_RX_AMOUNT only reflects the last *completed* DMA transfer, not the
    // in-progress byte count.  Calling it with a stale AMOUNT would commit
    // zeros from the freshly memset buffer and pin _rxDmaObservedAmount at
    // the stale value, preventing future partial flushes.  Byte delivery is
    // handled by the DMA_RX_END path in processRxDmaEvents, which is reached
    // after the FRAMETIMEOUT→DMA_RX_STOP shortcut fires.
    __set_PRIMASK(primask);
}

void HardwareSerial::startNextTxDmaLocked(uintptr_t base) {
    if (!_configured || _uart == nullptr || _txDmaRunning || _txCount == 0U) {
        return;
    }
    if (_constlatOwned) {
        NRF_POWER->TASKS_CONSTLAT = POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger;
    }

    uint16_t chunk = _txCount;
    if (chunk > kTxDmaChunkSize) {
        chunk = kTxDmaChunkSize;
    }
    if (chunk == 0U) {
        return;
    }

    uint16_t tail = _txTail;
    for (uint16_t i = 0U; i < chunk; ++i) {
        _txBuffer[i] = _txRing[tail];
        tail = static_cast<uint16_t>(
            (tail + 1U) & static_cast<uint16_t>(kTxRingSize - 1U));
    }

    reg32(base + U_EVENTS_DMA_TX_END) = 0U;
    reg32(base + U_EVENTS_DMA_TX_BUSERROR) = 0U;
    reg32(base + U_EVENTS_TXSTOPPED) = 0U;
    reg32(base + U_DMA_TX_PTR) =
        static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&_txBuffer[0]));
    reg32(base + U_DMA_TX_MAXCNT) = chunk;
    _txDmaCount = static_cast<uint8_t>(chunk);
    _txDmaRunning = true;
    reg32(base + U_TASKS_DMA_TX_START) = UARTE_TASKS_DMA_TX_START_START_Trigger;
}

void HardwareSerial::processTxDmaEvents(uintptr_t base) {
    if (!_configured || _uart == nullptr) {
        return;
    }

    if (reg32(base + U_EVENTS_DMA_TX_END) != 0U) {
        reg32(base + U_EVENTS_DMA_TX_END) = 0U;
    }

    if (reg32(base + U_EVENTS_DMA_TX_BUSERROR) != 0U) {
        reg32(base + U_EVENTS_DMA_TX_BUSERROR) = 0U;
        reg32(base + U_TASKS_DMA_TX_STOP) = UARTE_TASKS_DMA_TX_STOP_STOP_Trigger;
        _txDmaCount = 0U;
        _txDmaRunning = false;
    }

    if (reg32(base + U_EVENTS_TXSTOPPED) != 0U) {
        reg32(base + U_EVENTS_TXSTOPPED) = 0U;
        if (_txDmaRunning && _txDmaCount != 0U) {
            _txTail = static_cast<uint16_t>(
                (_txTail + _txDmaCount) & static_cast<uint16_t>(kTxRingSize - 1U));
            _txCount = static_cast<uint16_t>(_txCount - _txDmaCount);
            _txDmaCount = 0U;
            _txDmaRunning = false;
        }
    }

    if (!_txDmaRunning && _txCount != 0U) {
        startNextTxDmaLocked(base);
    }
}

void HardwareSerial::serviceTxDma() {
    if (!_configured || _uart == nullptr) {
        return;
    }

    if (usesBridgePins()) {
        flushBridgePending(false);
        return;
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();
    processTxDmaEvents(base);
    __set_PRIMASK(primask);
}

size_t HardwareSerial::writeBlocking(const uint8_t* buffer, size_t size) {
    if (!_configured || _uart == nullptr) {
        return 0U;
    }
    if (buffer == nullptr || size == 0U) {
        return 0U;
    }
    if (_constlatOwned) {
        NRF_POWER->TASKS_CONSTLAT = POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger;
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);
    reg32(base + U_EVENTS_DMA_TX_END) = 0U;
    reg32(base + U_EVENTS_DMA_TX_BUSERROR) = 0U;
    reg32(base + U_EVENTS_TXSTOPPED) = 0U;
    reg32(base + U_DMA_TX_PTR) = static_cast<uint32_t>(reinterpret_cast<uintptr_t>(buffer));
    reg32(base + U_DMA_TX_MAXCNT) = static_cast<uint32_t>(size);
    reg32(base + U_TASKS_DMA_TX_START) = UARTE_TASKS_DMA_TX_START_START_Trigger;

