lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
    if (!wait_event_timeout_us(base, U_EVENTS_DMA_TX_END,
                               serial_byte_timeout_us(_baud, static_cast<uint32_t>(size)))) {
        reg32(base + U_TASKS_DMA_TX_STOP) = UARTE_TASKS_DMA_TX_STOP_STOP_Trigger;
        wait_event_timeout_us(base, U_EVENTS_TXSTOPPED, 2000UL);
        return 0U;
    }

    if (reg32(base + U_EVENTS_DMA_TX_BUSERROR) != 0U) {
        reg32(base + U_EVENTS_DMA_TX_BUSERROR) = 0U;
        return 0U;
    }
    if (usesPins(PIN_SAMD11_RX, PIN_SAMD11_TX)) {
        wait_event_timeout_us(base, U_EVENTS_TXSTOPPED, 2000UL);
        delayMicroseconds(bridge_settle_delay_us(_baud));
    }
    return size;
}

bool HardwareSerial::usesBridgePins() const {
    return usesPins(PIN_SAMD11_RX, PIN_SAMD11_TX);
}

void HardwareSerial::flushBridgePending(bool forceNow) {
    if (!_configured || _uart == nullptr || !usesBridgePins()) {
        return;
    }

    while (_bridgePendingCount != 0U) {
        const uint8_t pendingCount = _bridgePendingCount;
        const bool timedOut =
            static_cast<unsigned long>(micros() - _bridgePendingLastWriteUs) >= kBridgeCoalesceUs;
        if (!forceNow && !timedOut && pendingCount < kBridgePendingSize) {
            return;
        }

        size_t chunk = pendingCount;
        if (chunk > kTxDmaChunkSize) {
            chunk = kTxDmaChunkSize;
        }
        if (chunk == 0U) {
            return;
        }

        const size_t sent = writeBlocking(_bridgePending, chunk);
        if (sent == 0U) {
            return;
        }

        const uint8_t remaining = static_cast<uint8_t>(pendingCount - sent);
        if (remaining != 0U) {
            memmove(_bridgePending, _bridgePending + sent, remaining);
        }
        _bridgePendingCount = remaining;

        if (!forceNow) {
            _bridgePendingLastWriteUs = micros();
            return;
        }
    }
}

void HardwareSerial::handleIrq() {
    if (_uart != nullptr && !usesBridgePins()) {
        processTxDmaEvents(reinterpret_cast<uintptr_t>(_uart));
    }
    processRxDmaEvents();
}

bool HardwareSerial::usesP2Pins() const {
    uint8_t txPort = 0U;
    uint8_t tx = 0U;
    uint8_t rxPort = 0U;
    uint8_t rx = 0U;
    if (!decode_pin(_txPin, &txPort, &tx) || !decode_pin(_rxPin, &rxPort, &rx)) {
        return false;
    }
    return (txPort == 2U) || (rxPort == 2U);
}

void HardwareSerial::requestConstlatIfNeeded() {
    if (!usesP2Pins() || _constlatOwned) {
        return;
    }

    if (g_ownedConstlatUsers != 0U) {
        ++g_ownedConstlatUsers;
        _constlatOwned = true;
        return;
    }

    if ((NRF_POWER->CONSTLATSTAT & POWER_CONSTLATSTAT_STATUS_Msk) != 0U) {
        return;
    }

    NRF_POWER->TASKS_CONSTLAT = POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger;
    g_ownedConstlatUsers = 1U;
    _constlatOwned = true;
}

void HardwareSerial::releaseConstlatIfNeeded() {
    if (!_constlatOwned) {
        return;
    }

    if (g_ownedConstlatUsers > 0U) {
        --g_ownedConstlatUsers;
    }
    if (g_ownedConstlatUsers == 0U) {
        NRF_POWER->TASKS_LOWPWR = POWER_TASKS_LOWPWR_TASKS_LOWPWR_Trigger;
    }
    _constlatOwned = false;
}

int HardwareSerial::available() {
    serviceRxDma();
    return static_cast<int>(_rxCount);
}

int HardwareSerial::availableForWrite() {
    serviceTxDma();
    if (usesBridgePins()) {
        if (_baud <= 9600UL) {
            return static_cast<int>(kTxDmaChunkSize);
        }
        return static_cast<int>(kBridgePendingSize - _bridgePendingCount);
    }
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();
    const int free = static_cast<int>(kTxRingSize - _txCount);
    __set_PRIMASK(primask);
    return free;
}

int HardwareSerial::read() {
    serviceRxDma();
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();
    if (_rxCount == 0U) {
        __set_PRIMASK(primask);
        return -1;
    }

    const uint8_t value = _rxRing[_rxTail];
    _rxTail = static_cast<uint16_t>(
        (_rxTail + 1U) & static_cast<uint16_t>(kRxRingSize - 1U));
    --_rxCount;
    __set_PRIMASK(primask);
    return static_cast<int>(value & _dataMask);
}

int HardwareSerial::peek() {
    serviceRxDma();
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();
    if (_rxCount == 0U) {
        __set_PRIMASK(primask);
        return -1;
    }
    const int value = static_cast<int>(_rxRing[_rxTail] & _dataMask);
    __set_PRIMASK(primask);
    return value;
}

void HardwareSerial::flush() {
    if (!_configured || _uart == nullptr) {
        return;
    }

    if (usesBridgePins()) {
        if (_baud > 9600UL) {
            flushBridgePending(true);
        }
        return;
    }

    while (true) {
        serviceTxDma();

        const uint32_t primask = __get_PRIMASK();
        __disable_irq();
        const bool idle = (_txCount == 0U) && !_txDmaRunning;
        __set_PRIMASK(primask);
        if (idle) {
            break;
        }

        if (primask == 0U) {
            yield();
        }
    }
}

size_t HardwareSerial::write(uint8_t value) {
    const uint8_t masked = static_cast<uint8_t>(value & _dataMask);
    return write(&masked, 1U);
}

size_t HardwareSerial::write(const uint8_t* buffer, size_t size) {
    if (!_configured || _uart == nullptr) {
        return 0U;
    }
    if (buffer == nullptr || size == 0U) {
        return 0U;
    }

    if (usesBridgePins()) {
        if (_baud <= 9600UL) {
            // The XIAO SAMD11 bridge can stay visually garbled on repeated
            // serial-monitor reopen at low baud when writes are coalesced too
            // aggressively. Push each Print call as its own blocking burst and
            // leave a short idle window between bursts so the bridge can
            // recover cleanly.
            size_t written = 0U;
            while (written < size) {
                size_t chunk = size - written;
                if (chunk > kTxDmaChunkSize) {
                    chunk = kTxDmaChunkSize;
                }

