lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
                if (_dataMask == 0xFFU) {
                    memcpy(_txBuffer, buffer + written, chunk);
                } else {
                    for (size_t i = 0U; i < chunk; ++i) {
                        _txBuffer[i] =
                            static_cast<uint8_t>(buffer[written + i] & _dataMask);
                    }
                }

                const size_t sent = writeBlocking(_txBuffer, chunk);
                written += sent;
                if (sent != chunk) {
                    break;
                }

                delay(3);

                if (written < size) {
                    yield();
                }
            }

            return written;
        }

        size_t written = 0U;
        while (written < size) {
            flushBridgePending(false);

            if (_bridgePendingCount >= kBridgePendingSize) {
                flushBridgePending(true);
                if (_bridgePendingCount >= kBridgePendingSize) {
                    break;
                }
            }

            size_t chunk = size - written;
            const size_t free =
                static_cast<size_t>(kBridgePendingSize - _bridgePendingCount);
            if (chunk > free) {
                chunk = free;
            }
            if (chunk == 0U) {
                break;
            }

            const size_t pendingOffset = _bridgePendingCount;
            if (_dataMask == 0xFFU) {
                memcpy(_bridgePending + pendingOffset, buffer + written, chunk);
            } else {
                for (size_t i = 0U; i < chunk; ++i) {
                    _bridgePending[pendingOffset + i] =
                        static_cast<uint8_t>(buffer[written + i] & _dataMask);
                }
            }

            _bridgePendingCount = static_cast<uint8_t>(pendingOffset + chunk);
            _bridgePendingLastWriteUs = micros();
            written += chunk;

            if (buffer_has_line_boundary(buffer + written - chunk, chunk) ||
                _bridgePendingCount >= kBridgePendingSize) {
                flushBridgePending(true);
            }
        }

        return written;
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);
    size_t written = 0U;
    while (written < size) {
        serviceTxDma();

        const uint32_t primask = __get_PRIMASK();
        __disable_irq();
        processTxDmaEvents(base);

        uint16_t free = static_cast<uint16_t>(kTxRingSize - _txCount);
        if (free == 0U) {
            __set_PRIMASK(primask);
            if (primask == 0U) {
                yield();
            }
            continue;
        }

        size_t chunk = size - written;
        if (chunk > free) {
            chunk = free;
        }

        if (_dataMask == 0xFFU) {
            for (size_t i = 0U; i < chunk; ++i) {
                _txRing[_txHead] = buffer[written + i];
                _txHead = static_cast<uint16_t>(
                    (_txHead + 1U) & static_cast<uint16_t>(kTxRingSize - 1U));
            }
        } else {
            for (size_t i = 0U; i < chunk; ++i) {
                _txRing[_txHead] = static_cast<uint8_t>(buffer[written + i] & _dataMask);
                _txHead = static_cast<uint16_t>(
                    (_txHead + 1U) & static_cast<uint16_t>(kTxRingSize - 1U));
            }
        }
        _txCount = static_cast<uint16_t>(_txCount + chunk);
        written += chunk;

        startNextTxDmaLocked(base);
        __set_PRIMASK(primask);

        if (written < size && primask == 0U && chunk == free) {
            yield();
        }
    }

    return written;
}

HardwareSerial::operator bool() const {
    return _configured && (_uart != nullptr);
}

bool HardwareSerial::isConfigured() const {
    return _configured && (_uart != nullptr);
}

bool HardwareSerial::usesPins(uint8_t txPin, uint8_t rxPin) const {
    return (_txPin == txPin) && (_rxPin == rxPin);
}

extern "C" void nrf54l15_serial_prepare_idle_sleep(void) {
    if (g_ownedConstlatUsers != 0U) {
        NRF_POWER->TASKS_CONSTLAT = POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger;
    }
}

extern "C" uint8_t nrf54l15_constlat_users_active(void) {
    return (g_ownedConstlatUsers != 0U) ? 1U : 0U;
}

static constexpr uint8_t kSerialPinDisconnected = 0xFFU;

#if defined(NRF54L15_CLEAN_SERIAL_DISABLED)
HardwareSerial Serial(NRF_UARTE21, kSerialPinDisconnected, kSerialPinDisconnected);
HardwareSerial Serial1(NRF_UARTE20, kSerialPinDisconnected, kSerialPinDisconnected);
#elif defined(NRF54L15_CLEAN_SERIAL_ROUTE_HEADER)
#if defined(NRF54L15_CLEAN_SERIAL_ROUTE_HEADER_SWAP_INSTANCES)
HardwareSerial Serial(NRF_UARTE20, PIN_SERIAL_TX, PIN_SERIAL_RX);
HardwareSerial Serial1(NRF_UARTE21, PIN_SAMD11_RX, PIN_SAMD11_TX);
#else
HardwareSerial Serial(NRF_UARTE21, PIN_SERIAL_TX, PIN_SERIAL_RX);
HardwareSerial Serial1(NRF_UARTE20, PIN_SAMD11_RX, PIN_SAMD11_TX);
#endif
#else
HardwareSerial Serial(NRF_UARTE20, PIN_SAMD11_RX, PIN_SAMD11_TX);
HardwareSerial Serial1(NRF_UARTE21, PIN_SERIAL1_TX, PIN_SERIAL1_RX);
#endif

// Compatibility alias for sketches/libraries that expect Serial2.
HardwareSerial& Serial2 = Serial1;

extern "C" uint8_t nrf54l15_bridge_serial_active(void) {
    const bool serialBridgeActive =
        Serial.isConfigured() && Serial.usesPins(PIN_SAMD11_RX, PIN_SAMD11_TX);
    const bool serial1BridgeActive =
        Serial1.isConfigured() && Serial1.usesPins(PIN_SAMD11_RX, PIN_SAMD11_TX);
    return (serialBridgeActive || serial1BridgeActive) ? 1U : 0U;
}

extern "C" void nrf54l15_serial_idle_service(void) {
    Serial.serviceTxDma();
    Serial1.serviceTxDma();
}
